JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
/*
 * Copyright 2021-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_endpoint.h"

/*! @name NETC register map. */
/*@{*/
#define NETC_ENETC_PCIE_FUNC_OFFSET       (3U)       /*!< The ENETC PCIE function index. */
#define NETC_ENETC_PORT_GROUP_BASE_OFFSET (0x4000U)  /*!< The ENETC port group register base address offset. */
#define NETC_ENETC_GLOBAL_BASE_OFFSET     (0x10000U) /*!< The ENETC global register base address offset. */
/*@}*/

/*! @name Defines some Ethernet parameters. */
/*@{*/
#define NETC_ENETC_TXFRAME_LEN_MAX (9600U) /*!< The Maximum length of frame length. */
#define NETC_ENETC_TXFRAME_LEN_MIN (16U)   /*!< The Minimum length of frame length. */
/*@}*/

/*! @brief Mask the cache management code if cache control is disabled. */
#if !defined(FSL_ETH_ENABLE_CACHE_CONTROL)
#define NETC_DcacheInvalidateByRange(address, sizeByte)
#define NETC_DcacheCleanByRange(address, sizeByte)
#else
#define NETC_DcacheInvalidateByRange(address, sizeByte) DCACHE_InvalidateByRange(address, sizeByte)
#define NETC_DcacheCleanByRange(address, sizeByte)      DCACHE_CleanByRange(address, sizeByte)
#endif

/*! @brief Pointers to netc bases for each instance. */
static ENETC_PCI_TYPE0_Type *const s_netcBases[] = ENETC_PCI_TYPE0_BASE_PTRS;

/*! @brief Pointers to enetc bases for each instance. */
static NETC_ENETC_Type *const s_netcEnetcBases[] = NETC_ENETC_BASE_PTRS;

/*! @brief Command BD common buffer. */
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t s_cmdData, 16);

/*!
 * @brief Get register map resource for handle
 *
 * @param handle  The EP handle.
 * @param si      The SI object.
 */
static void EP_GetBaseResource(ep_handle_t *handle, netc_hw_si_idx_t si)
{
    uint8_t instance = getSiInstance(si);
    uint8_t siNum    = getSiNum(si);
    uint8_t siIdx    = getSiIdx(si);

    handle->hw.base           = s_netcEnetcBases[instance];
    handle->hw.common         = (NETC_SW_ENETC_Type *)((uintptr_t)handle->hw.base);
    handle->hw.portGroup.port = (NETC_PORT_Type *)((uintptr_t)handle->hw.base + NETC_ENETC_PORT_GROUP_BASE_OFFSET);
    handle->hw.portGroup.eth  = (NETC_ETH_LINK_Type *)((uintptr_t)handle->hw.base + NETC_ENETC_PORT_GROUP_BASE_OFFSET);
    handle->hw.global         = (ENETC_GLOBAL_Type *)((uintptr_t)handle->hw.base + NETC_ENETC_GLOBAL_BASE_OFFSET);
    if (siNum == 0U)
    {
        handle->hw.func.pf = s_netcBases[NETC_ENETC_PCIE_FUNC_OFFSET + instance];
        handle->hw.si      = (ENETC_SI_Type *)((uintptr_t)handle->hw.base - 0x10000U);
        handle->hw.msixTable =
            (netc_msix_entry_t *)(FSL_FEATURE_NETC_MSIX_TABLE_BASE + NETC_MSIX_TABLE_OFFSET * (3U + (uint32_t)siIdx));
    }
    else
    {
        handle->hw.func.vf   = NETC_VF1_PCI_HDR_TYPE0;
        handle->hw.si        = (ENETC_SI_Type *)((uintptr_t)handle->hw.base + 0xC0000U);
        handle->hw.msixTable = (netc_msix_entry_t *)(0x60C20000U);
    }
}

/*!
 * @brief Store necessary configuration constant in the handle
 *
 * @param handle  The EP handle.
 * @param config  The user configuration.
 */
static void EP_StoreConfig(ep_handle_t *handle, const ep_config_t *config)
{
    handle->cfg.si              = config->si;
    handle->cfg.rxRingUse       = config->siConfig.rxRingUse;
    handle->cfg.txRingUse       = config->siConfig.txRingUse;
    handle->cfg.rxBdrGroupNum   = config->siConfig.rxBdrGroupNum;
    handle->cfg.ringPerBdrGroup = config->siConfig.ringPerBdrGroup;
    handle->cfg.entryNum        = config->entryNum;
    handle->cfg.reclaimCallback = config->reclaimCallback;
    handle->cfg.userData        = config->userData;
    handle->cfg.rxCacheMaintain = config->rxCacheMaintain;
    handle->cfg.txCacheMaintain = config->txCacheMaintain;
    handle->cfg.rxZeroCopy      = config->rxZeroCopy;
    handle->cfg.rxBuffAlloc     = config->rxBuffAlloc;
    handle->cfg.rxBuffFree      = config->rxBuffFree;
}

/*!
 * @brief Free all Rx buffers
 *
 * @param handle  The EP handle.
 */
static void EP_RxBufferFreeAll(ep_handle_t *handle)
{
    netc_rx_bdr_t *rxBdRing;
    uint32_t maxHwBdNum;
    uint32_t index;
    uint8_t ring;

    if (handle->cfg.rxZeroCopy)
    {
        for (ring = 0U; ring < handle->cfg.rxRingUse; ring++)
        {
            rxBdRing = &handle->rxBdRing[ring];
            /* Hardware BD number means actual BD number in hardware view, two standard BDs act as one extended BD. */
            maxHwBdNum = rxBdRing->extendDesc ? (rxBdRing->len / 2U) : rxBdRing->len;

            for (index = 0U; index < maxHwBdNum; index++)
            {
                if (rxBdRing->buffArray[index] != 0U)
                {
                    handle->cfg.rxBuffFree(handle, ring, (void *)(uint8_t *)(uintptr_t)rxBdRing->buffArray[index],
                                           handle->cfg.userData);
                }
            }
        }
    }
}

/*!
 * @brief Allocate Rx buffers for Rx BD rings
 *
 * @param handle     The EP handle.
 * @param config     The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_RxBufferAllocAll(ep_handle_t *handle, const ep_config_t *config, const netc_bdr_config_t *bdrConfig)
{
    status_t result = kStatus_Success;
    const netc_rx_bdr_config_t *rxRingConfig;
    netc_rx_bd_t *rxDesc;
    uint64_t buffAddr;
    uint16_t buffIdx;
    uint16_t index;
    uint8_t ring;

    for (ring = 0U; ring < config->siConfig.rxRingUse; ring++)
    {
        rxRingConfig = &bdrConfig->rxBdrConfig[ring];
        rxDesc       = &rxRingConfig->bdArray[0];

        /* Store address information in the array in case the buffer address is lost due to Rx BD write-back. */
        handle->rxBdRing[ring].buffArray = rxRingConfig->buffAddrArray;

        /* Initialize the buffers in Rx BD ring. */
        for (index = 0U; index < rxRingConfig->len; index++)
        {
            /* Clear Rx BD before config the receive buffer start address */
            (void)memset(rxDesc, 0, sizeof(netc_rx_bd_t));

            /* When extended BD is enabled, two standard BDs represet one extended BD. Even number BD sets 0. */
            if (rxRingConfig->extendDescEn && (index % 2U != 0U))
            {
                rxDesc++;
                continue;
            }

            buffIdx = rxRingConfig->extendDescEn ? (index / 2U) : index;
            if (!config->rxZeroCopy)
            {
                /* Get Rx buffer address from the address array provided by application. */
                buffAddr = handle->rxBdRing[ring].buffArray[buffIdx];
            }
            else
            {
                /* Get Rx buffer address from the allocation function provided by application. */
                buffAddr = (uint64_t)(uintptr_t)(uint8_t *)handle->cfg.rxBuffAlloc(
                    handle, ring, handle->rxBdRing[ring].buffSize, handle->cfg.userData);
                if (buffAddr == 0U)
                {
                    EP_RxBufferFreeAll(handle);
                    result = kStatus_NETC_LackOfResource;
                    break;
                }

                /* Keep Rx buffer address from pool in driver until it's freed. */
                handle->rxBdRing[ring].buffArray[buffIdx] = buffAddr;
            }

#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            buffAddr = MEMORY_ConvertMemoryMapAddress((uintptr_t)buffAddr, kMEMORY_Local2DMA);
#endif
            rxDesc->standard.addr = buffAddr;
            rxDesc++;
        }

        if (result != kStatus_Success)
        {
            break;
        }
    }

    return result;
}

/*!
 * @brief Initialize the Tx/Rx BD ring
 *
 * @param handle     The EP handle.
 * @param config     The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_DescriptorInit(ep_handle_t *handle, const ep_config_t *config, const netc_bdr_config_t *bdrConfig)
{
    assert(bdrConfig != NULL);

    status_t result  = kStatus_Success;
    uint8_t idxStart = 0U;
    uint8_t ring;

    /* Setup Tx/Rx buffer descriptor rings. */
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* For management ENETC, the SI 0 hardware Tx ring index 0 has been keep for direct switch enqueue feature */
        idxStart = 1;
    }
    for (ring = 0; ring < config->siConfig.txRingUse; ring++)
    {
        if (NETC_SIConfigTxBDR(handle->hw.si, ring + idxStart, &bdrConfig->txBdrConfig[ring]) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->txBdRing[ring].bdBase    = bdrConfig->txBdrConfig[ring].bdArray;
        handle->txBdRing[ring].dirtyBase = bdrConfig->txBdrConfig[ring].dirtyArray;
        handle->txBdRing[ring].len       = bdrConfig->txBdrConfig[ring].len;
    }
    for (ring = 0; ring < config->siConfig.rxRingUse; ring++)
    {
        if (NETC_SIConfigRxBDR(handle->hw.si, ring, &bdrConfig->rxBdrConfig[ring]) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->rxBdRing[ring].extendDesc = bdrConfig->rxBdrConfig[ring].extendDescEn;
        handle->rxBdRing[ring].bdBase     = bdrConfig->rxBdrConfig[ring].bdArray;
        handle->rxBdRing[ring].len        = bdrConfig->rxBdrConfig[ring].len;
        handle->rxBdRing[ring].buffSize   = bdrConfig->rxBdrConfig[ring].buffSize;
    }

    /* Allocate Rx buffers to the BDs. */
    result = EP_RxBufferAllocAll(handle, config, bdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Enable the used BD ring. */
    for (ring = 0; ring < config->siConfig.rxRingUse; ring++)
    {
        NETC_SIRxRingEnable(handle->hw.si, ring, true);
    }

    return kStatus_Success;
}

/*!
 * @brief Setup Station Interface
 *
 * @param handle     The EP handle.
 * @param si         The SI number.
 * @param epConfig   The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_SISetup(ep_handle_t *handle,
                           uint8_t si,
                           const ep_config_t *epConfig,
                           const netc_bdr_config_t *bdrConfig)
{
    status_t result;

    if (((epConfig->siConfig.ringPerBdrGroup * epConfig->siConfig.rxBdrGroupNum) > epConfig->siConfig.rxRingUse) ||
        (((uint8_t)epConfig->siConfig.defaultRxBdrGroup >= epConfig->siConfig.rxBdrGroupNum) &&
         (epConfig->siConfig.defaultRxBdrGroup != kNETC_SiBDRGroupOne)) ||
        (epConfig->siConfig.ringPerBdrGroup == 0U))
    {
        /* Not recommended to make groups use more rings than the total number available, and Can't selected non
         * existing group */
        return kStatus_InvalidArgument;
    }

    NETC_SISetRxBDRGroup(handle->hw.si, (uint8_t)epConfig->siConfig.rxBdrGroupNum,
                         (uint8_t)epConfig->siConfig.ringPerBdrGroup);
    NETC_SISetDefaultRxBDRGroup(handle->hw.si, epConfig->siConfig.defaultRxBdrGroup);

    /* Configure station interface. */
    result = NETC_EnetcConfigureSI(handle->hw.base, si, &epConfig->siConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Initialize the Tx/Rx buffer descriptor. */
    result = EP_DescriptorInit(handle, epConfig, bdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }
    NETC_SIEnableVlanToIpv(handle->hw.si, (bool)epConfig->siConfig.valnToIpvEnable);
    for (uint8_t i = 0U; i < 16U; i++)
    {
        if (epConfig->siConfig.vlanToIpvMap[i] > 7U)
        {
            /* The mapped IPV value range in 0 ~ 7 */
            return kStatus_InvalidArgument;
        }
        else
        {
            NETC_SIMapVlanToIpv(handle->hw.si, i, epConfig->siConfig.vlanToIpvMap[i]);
        }
    }
    for (uint8_t i = 0U; i < 8U; i++)
    {
        if ((epConfig->siConfig.ipvToRingMap[i] != 0U) &&
            (epConfig->siConfig.ipvToRingMap[i] >= epConfig->siConfig.ringPerBdrGroup))
        {
            /* The mapped BD ring should be located in one BD ring group */
            return kStatus_InvalidArgument;
        }
        else
        {
            NETC_SIMapIpvToRing(handle->hw.si, i, epConfig->siConfig.ipvToRingMap[i]);
        }
    }

    /* Enable station interface from both ENETC and SI sides. */
    NETC_EnetcEnableSI(handle->hw.base, si, true);
    NETC_SIEnable(handle->hw.si, true);

    return result;
}

/*!
 * @brief Set the MSIX entry table
 *
 * This function is to set entry table in specified MSIX Table memory. After entry table setup, set interrupts
 * vector/entry index.
 *
 * @param handle  The EP handle.
 * @param config  The EP configuration.
 * @return status_t
 */
static status_t EP_MSIXSetEntryTable(ep_handle_t *handle, const ep_config_t *config)
{
    uint32_t *msixTable  = (uint32_t *)(uintptr_t)handle->hw.msixTable;
    uint32_t *entryTable = (uint32_t *)(uintptr_t)config->msixEntry;
    uint8_t siNum        = getSiNum(handle->cfg.si);
    uint8_t msixNum;
    status_t result;

    result = NETC_EnetcSetMsixEntryNum(handle->hw.base, siNum, config->entryNum);
    if (result != kStatus_Success)
    {
        return result;
    }

    msixNum = (uint8_t)(
        ((handle->hw.si->SIPCAPR1 & ENETC_SI_SIPCAPR1_NUM_MSIX_MASK) >> ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT) + 1U);

    /* Entry > 0, enable MSIX. */
    if (config->entryNum != 0U)
    {
        if (config->entryNum > msixNum)
        {
            return kStatus_InvalidArgument;
        }

        if (MAX(MAX(config->siComEntryIdx, config->timerSyncEntryIdx), config->cmdBdEntryIdx) >= config->entryNum)
        {
            return kStatus_InvalidArgument;
        }

        /* Use 32-bit access to set MSIX table. */
        for (uint32_t i = 0; i < config->entryNum; i++)
        {
            msixTable[i * 4U]      = entryTable[i * 4U];
            msixTable[i * 4U + 1U] = entryTable[i * 4U + 1U];
            msixTable[i * 4U + 2U] = entryTable[i * 4U + 2U];
            msixTable[i * 4U + 3U] = entryTable[i * 4U + 3U];
        }

