JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
    /* Set primary MAC address */
    result = EP_SetPrimaryMacAddr(handle, macAddr);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Set the MSIX table to handle interrupts */
    result = EP_MSIXSetEntryTable(handle, config);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Initialize station interface */
    result = EP_SISetup(handle, siNum, config, bdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Initialize command BD ring for NTMP access */
    result = EP_CmdBDRInit(handle, &config->cmdBdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    if (siNum == 0U)
    {
        /* Config TGS on PSI side */
        result = EP_TxPortTGSEnable(handle, config->port.enableTg, 0xFFU);
    }
    return result;
}

status_t EP_Deinit(ep_handle_t *handle)
{
    uint8_t siNum = getSiNum(handle->cfg.si);

    (void)EP_CmdBDRDeinit(handle);
    NETC_EnetcEnableSI(handle->hw.base, siNum, false);
    NETC_SIEnable(handle->hw.si, false);
    if (!NETC_PortIsPseudo(handle->hw.portGroup.port))
    {
        NETC_PortEthMacGracefulStop(handle->hw.portGroup.port);
    }

    EP_RxBufferFreeAll(handle);

    return kStatus_Success;
}

status_t EP_Up(ep_handle_t *handle, netc_hw_mii_speed_t speed, netc_hw_mii_duplex_t duplex)
{
    status_t result = kStatus_Success;
    uint8_t siNum   = getSiNum(handle->cfg.si);
    netc_hw_mii_mode_t miiMode;

    if ((siNum == 0U) && (!NETC_PortIsPseudo(handle->hw.portGroup.port)))
    {
        miiMode = NETC_PortGetMIIMode(handle->hw.portGroup.eth);
        result  = NETC_PortSetMII(handle->hw.portGroup.eth, miiMode, speed, duplex);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    NETC_EnetcEnableSI(handle->hw.base, siNum, true);
    NETC_SIEnable(handle->hw.si, true);

    return result;
}

status_t EP_Down(ep_handle_t *handle)
{
    NETC_EnetcEnableSI(handle->hw.base, getSiNum(handle->cfg.si), false);
    NETC_SIEnable(handle->hw.si, false);

    return kStatus_Success;
}

status_t EP_SetPrimaryMacAddr(ep_handle_t *handle, uint8_t *macAddr)
{
    assert(macAddr != NULL);

    uint8_t siNum = getSiNum(handle->cfg.si);

    if (siNum == 0U)
    {
        NETC_PortSetMacAddr(handle->hw.portGroup.port, macAddr);
    }
    else
    {
        NETC_EnetcSetSIMacAddr(handle->hw.base, siNum, macAddr);
    }

    return kStatus_Success;
}

status_t EP_SendFrameCommon(ep_handle_t *handle,
                            netc_tx_bdr_t *txBdRing,
                            uint8_t hwRing,
                            netc_frame_struct_t *frame,
                            void *context,
                            netc_tx_bd_t *txDesc,
                            bool txCacheMaintain)
{
    assert((frame != NULL) && (frame->buffArray != NULL));

    status_t result              = kStatus_Success;
    netc_buffer_struct_t *txBuff = frame->buffArray;
    uint32_t totBdNum            = frame->length;
    uint16_t frameLen            = 0;
    bool isExtEnable             = (bool)txDesc[0].standard.isExtended;
    uint32_t address;
    netc_tx_bd_t *txDesTemp = NULL;

    /* Check the frame length. */
    if ((frame->buffArray[0].length < NETC_ENETC_TXFRAME_LEN_MIN) || (frame->length == 0U))
    {
        result = kStatus_NETC_TxFrameOverLen;
    }

    /* Calculate frame length and Tx data buffer number. */
    do
    {
        frameLen += txBuff->length;
        txBuff++;
    } while (--totBdNum != 0U);

    if (isExtEnable)
    {
        totBdNum = (uint32_t)frame->length + 1U;
    }
    else
    {
        totBdNum = frame->length;
    }

    /* Check the frame total length. */
    if ((frameLen > NETC_ENETC_TXFRAME_LEN_MAX) || (frameLen < NETC_ENETC_TXFRAME_LEN_MIN))
    {
        result = kStatus_NETC_TxFrameOverLen;
    }
    /* Check whether the available BD number is enough for Tx data buffer. */
    else if (totBdNum > EP_GetIdleTxBDNum(txBdRing))
    {
        result = kStatus_Busy;
    }
    else
    {
        txBuff = frame->buffArray;
        for (uint32_t bdIndex = 0; bdIndex < totBdNum; bdIndex++)
        {
            /* Check the buffer address */
            if (txBuff->buffer == NULL)
            {
                return kStatus_InvalidArgument;
            }

            if (txCacheMaintain)
            {
                /* Swith API share same cache */
                NETC_DcacheCleanByRange((uint32_t)txBuff->buffer, txBuff->length);
            }
            /* Get latest Tx BD address and clean it content. */
            txDesTemp = &txBdRing->bdBase[txBdRing->producerIndex];
            (void)memset(txDesTemp, 0, sizeof(netc_tx_bd_t));
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            address =
                (uintptr_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)(uint8_t *)txBuff->buffer, kMEMORY_Local2DMA);
#else
            address = (uintptr_t)(uint32_t *)txBuff->buffer;
#endif
            if (bdIndex == 0U)
            {
                /* Update latest Tx dirty frame info. */
                txBdRing->dirtyBase[txBdRing->producerIndex].context = context;
                if (0U != (txDesc[0].standard.flags & NETC_SI_TXDESCRIP_RD_TSR_MASK))
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTxTsIdAvail = true;
                }
                else
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTxTsIdAvail = false;
                }

                if (isExtEnable && (0U != (txDesc[1].ext.eFlags & (uint32_t)kNETC_TxExtTwoStepTs)))
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTsAvail = true;
                }
                else
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTsAvail = false;
                }
                /* Copy user Tx descriptors to hardware Tx BD. */
                txDesTemp->standard.flags      = txDesc[0].standard.flags;
                txDesTemp->standard.addr       = address;
                txDesTemp->standard.bufLen     = txBuff->length;
                txDesTemp->standard.frameLen   = frameLen;
                txDesTemp->standard.isExtended = (uint32_t)isExtEnable;
                txDesTemp->standard.enableInterrupt =
                    (uint32_t)((handle->hw.si->BDR[hwRing].TBIER & ENETC_SI_TBIER_TXFIE_MASK) != 0U);
                if (isExtEnable)
                {
                    /* Increase producer index when first BD is extension BD. */
                    txBdRing->producerIndex = EP_IncreaseIndex(txBdRing->producerIndex, txBdRing->len);
                    txDesTemp               = &txBdRing->bdBase[txBdRing->producerIndex];
                    txDesTemp->ext          = txDesc[1].ext;
                    bdIndex++;
                }
            }
            else
            {
                txDesTemp->standard.addr   = address;
                txDesTemp->standard.bufLen = txBuff->length;
            }

