JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
            /* Increase tx buffer address index and producer index. */
            txBuff++;
            txBdRing->producerIndex = EP_IncreaseIndex(txBdRing->producerIndex, txBdRing->len);
        }

        /* Set final flag in last BD, same bit for stand or extension BD */
        if (txDesTemp != NULL)
        {
            txDesTemp->standard.isFinal = 1;
        }

        /* Make sure all data in the Tx BD is ready. */
        __DSB();

        /* Active Tx. */
        NETC_SISetTxProducer(handle->hw.si, hwRing, txBdRing->producerIndex);
    }

    return result;
}

status_t EP_SendFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, void *context, ep_tx_opt *opt)
{
    assert(handle != NULL);
    netc_tx_bd_t txDesc[2] = {0};
    uint8_t hwRing         = ring;

    if (ring >= handle->cfg.txRingUse)
    {
        /* Tx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing = ring + 1U;
    }

    if (opt != NULL)
    {
        if ((opt->flags & (uint32_t)kEP_TX_OPT_START_TIME) != 0U)
        {
            txDesc[0].standard.flags = NETC_SI_TXDESCRIP_RD_FLQ(0x2U) | NETC_SI_TXDESCRIP_RD_TSE_MASK |
                                       NETC_SI_TXDESCRIP_RD_TXSTART(opt->timestamp);
        }
        if ((opt->flags & (uint32_t)kEP_TX_OPT_VLAN_INSERT) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.pcp             = opt->vlan.pcp;
            txDesc[1].ext.dei             = opt->vlan.dei;
            txDesc[1].ext.vid             = opt->vlan.vid;
            txDesc[1].ext.tpid            = (uint16_t)opt->vlan.tpid;
            txDesc[1].ext.eFlags          = (uint8_t)kNETC_TxExtVlanInsert;
        }
        if ((opt->flags & (uint32_t)kEP_TX_OPT_REQ_TS) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= (uint8_t)kNETC_TxExtTwoStepTs;
        }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
        if ((opt->flags & (uint32_t)kEP_TX_OPT_REQ_ONE_STEP_TS) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= (uint8_t)kNETC_TxExtOneStepTs;
        }
#endif
    }
    return EP_SendFrameCommon(handle, &handle->txBdRing[ring], hwRing, frame, context, &txDesc[0],
                              handle->cfg.txCacheMaintain);
}

netc_tx_frame_info_t *EP_ReclaimTxDescCommon(ep_handle_t *handle,
                                             netc_tx_bdr_t *txBdRing,
                                             uint8_t hwRing,
                                             bool enCallback)
{
    netc_tx_frame_info_t *frameInfo = NULL;
    netc_tx_bd_t *txDesc;
    uint16_t cleanNum;
    uint16_t consumer = NETC_SIGetTxConsumer(handle->hw.si, hwRing);

    /* Get the dirty Tx BD number ready for reclaiming in the ring */
    if (consumer >= txBdRing->cleanIndex)
    {
        cleanNum = (consumer - txBdRing->cleanIndex);
    }
    else
    {
        cleanNum = (uint16_t)(txBdRing->len - txBdRing->cleanIndex + consumer);
    }

    while (cleanNum-- != 0U)
    {
        /* When callback enable, get the reclaim information. */
        if (enCallback)
        {
            txDesc = &txBdRing->bdBase[txBdRing->cleanIndex];

            /* Valid Tx frame information is in the first BD of one BD chain. */
            if (txDesc->writeback.written != 0U)
            {
                frameInfo = &txBdRing->dirtyBase[txBdRing->cleanIndex];
                if (frameInfo->isTsAvail)
                {
                    frameInfo->timestamp = txDesc->writeback.timestamp;
                }
                if (frameInfo->isTxTsIdAvail)
                {
                    frameInfo->txtsid = (uint16_t)txDesc->writeback.txtsid;
                }
                frameInfo->status = (netc_ep_tx_status_t)txDesc->writeback.status;
            }
            else if (txDesc->standard.frameLen != 0U)
            {
                frameInfo         = &txBdRing->dirtyBase[txBdRing->cleanIndex];
                frameInfo->status = kNETC_EPTxSuccess;
            }
            else
            {
                /* Intentional empty */
            }
        }

        /* Update the clean index to free BD resource. */
        txBdRing->cleanIndex = EP_IncreaseIndex(txBdRing->cleanIndex, txBdRing->len);

        if (cleanNum == 0U)
        {
            consumer = NETC_SIGetTxConsumer(handle->hw.si, hwRing);
            /* Get the dirty Tx BD number again */
            if (consumer >= txBdRing->cleanIndex)
            {
                cleanNum = (consumer - txBdRing->cleanIndex);
            }
            else
            {
                cleanNum = (uint16_t)(txBdRing->len - txBdRing->cleanIndex + consumer);
            }
        }
    }
    return frameInfo;
}

void EP_ReclaimTxDescriptor(ep_handle_t *handle, uint8_t ring)
{
    assert(ring < handle->cfg.txRingUse);
    netc_tx_frame_info_t *frameInfo;
    uint8_t hwRing = ring;

    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing = ring + 1U;
    }
    frameInfo = EP_ReclaimTxDescCommon(handle, &handle->txBdRing[ring], hwRing, (handle->cfg.reclaimCallback != NULL));
    if (frameInfo != NULL)
    {
        (void)handle->cfg.reclaimCallback(handle, ring, frameInfo, handle->cfg.userData);
        (void)memset(frameInfo, 0, sizeof(netc_tx_frame_info_t));
    }
}

status_t EP_GetRxFrameSizeCommon(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint32_t *length)
{
    status_t result      = kStatus_NETC_RxHRZeroFrame;
    netc_rx_bd_t *rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    uint16_t index       = rxBdRing->index;
    uint32_t totlen      = 0;

    /* Reset the length to zero. */
    *length = 0;

    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if (rxDesc->writeback.isReady == 0U)
    {
        result = kStatus_NETC_RxFrameEmpty;
    }
    else
    {
        /* Check the status of the received frame. */
        if (rxDesc->writeback.error != 0U)
        {
            result = kStatus_NETC_RxFrameError;
        }
        else if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_TimestampResp)
        {
            if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_RegularFrame)
            {
                result = kStatus_NETC_RxHRNotZeroFrame;
            }
            else
            {
                result = kStatus_NETC_RxHRZeroFrame;
            }
            do
            {
                /* Check abnormal case. */
                if (rxDesc->writeback.bufLen == 0U)
                {
                    result = kStatus_NETC_RxFrameError;
                    break;
                }
                totlen += rxDesc->writeback.bufLen;

                /* Find the last buffer descriptor. */
                if (rxDesc->writeback.isFinal != 0U)
                {
                    *length = totlen;
                    break;
                }

                /* Extended BD needs additional offset. */
                if (rxBdRing->extendDesc)
                {
                    index = EP_IncreaseIndex(index, rxBdRing->len);
                }

                /* Increase to next buffer descriptor. */
                index  = EP_IncreaseIndex(index, rxBdRing->len);
                rxDesc = &rxBdRing->bdBase[index];
            } while (index != rxBdRing->index);
        }
        else
        {
            /* Get Transmit Timestamp Reference Response messages */
            result = kStatus_NETC_RxTsrResp;
        }
    }
    return result;
}

status_t EP_GetRxFrameSize(ep_handle_t *handle, uint8_t ring, uint32_t *length)
{
    assert((handle != NULL) && (length != NULL));
    status_t result;
    if (ring >= handle->cfg.rxRingUse)
    {
        /* Rx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }
    else
    {
        result = EP_GetRxFrameSizeCommon(handle, &handle->rxBdRing[ring], length);
        if (kStatus_NETC_RxHRZeroFrame == result)
        {
            /* Only return success when currently frame is regular frame */
            result = kStatus_Success;
        }
        return result;
    }
}

static void EP_GetRxFrameAttribute(ep_handle_t *handle, netc_rx_bd_t *rxDesc, netc_frame_attr_t *attr)
{
    bool isPseudoPort = NETC_PortIsPseudo(handle->hw.portGroup.port);

