JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
        if (rxCacheMaintain)
        {
            NETC_DcacheInvalidateByRange((uintptr_t)rxDmaBuff, rxBdRing->buffSize);
        }

        newBuff                        = frame->buffArray[index].buffer;
        frame->buffArray[index].buffer = (void *)(uint8_t *)(uintptr_t)rxDmaBuff;
        frame->buffArray[index].length = rxDesc->writeback.bufLen;
        index++;

        /* Update the buffer address array. */
        rxBdRing->buffArray[buffIdx] = (uint64_t)(uintptr_t)(uint8_t *)newBuff;

        rxDmaBuff = (uint64_t)(uintptr_t)(uint8_t *)newBuff;
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        rxDmaBuff = (uint64_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)rxDmaBuff, kMEMORY_Local2DMA);
#endif
        rxDesc->standard.addr = rxDmaBuff;

        /* The last buffer descriptor of one frame. */
        isLastBd = (rxDesc->writeback.isFinal != 0U) ? true : false;

        /* Updates the receive buffer descriptors. */
        rxDesc->writeback.isFinal = 0;
        rxDesc->writeback.isReady = 0;

        if (rxBdRing->extendDesc)
        {
            /* Extended BD occupies one more 16 bytes space. */
            rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);

            /* Get the timestamp from extended BD if it's valid. */
            if ((attr != NULL) && isTsBd && attr->isTsAvail)
            {
                /* Only first extended BD takes timestamp. */
                rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
                attr->timestamp = rxDesc->ext.timestamp;
                isTsBd          = false;
            }
        }

        /* Get the latest buffer descriptor. */
        rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
        rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
    } while (!isLastBd);

    /* Get the Rx buffer array length. */
    frame->length = index;

    /* Update the Rx consumer index to free idle BD */
    index = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
    NETC_SISetRxConsumer(handle->hw.si, ring, index);

    return result;
}

status_t EP_ReceiveFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, netc_frame_attr_t *attr)
{
    assert(handle != NULL);
    assert(handle->cfg.rxZeroCopy);
    assert(frame != NULL);

    status_t result         = kStatus_Success;
    netc_rx_bdr_t *rxBdRing = NULL;
    netc_rx_bd_t *rxDesc    = NULL;
    uint32_t buffNum        = 0U;
    uint16_t index;
    void *newBuff;

    if (ring >= handle->cfg.rxRingUse)
    {
        /* Rx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }
    rxBdRing = &handle->rxBdRing[ring];
    rxDesc   = &rxBdRing->bdBase[rxBdRing->index];

    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if (rxDesc->writeback.isReady == 0U)
    {
        /* Reset the buffer array length. */
        frame->length = 0;
        return kStatus_NETC_RxFrameEmpty;
    }
    else
    {
        /* Check the status of the received frame. */
        if (rxDesc->writeback.error != 0U)
        {
            result = kStatus_NETC_RxFrameError;
        }
        else if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_TimestampResp)
        {
            if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_RegularFrame)
            {
                /* Return without receive when currently frame is not regular frame */
                return kStatus_NETC_RxHRNotZeroFrame;
            }
            /* Check how many buffers will be taken away to receive one frame. */
            index = rxBdRing->index;
            do
            {
                buffNum++;

                /* Find the last BD of this frame. */
                if (rxDesc->writeback.isFinal != 0U)
                {
                    break;
                }

                if (rxBdRing->extendDesc)
                {
                    /* Extended BD needs additional offset. */
                    index = EP_IncreaseIndex(index, rxBdRing->len);
                }
                index  = EP_IncreaseIndex(index, rxBdRing->len);
                rxDesc = &rxBdRing->bdBase[index];
            } while (index != rxBdRing->index);

            /* The buffer array length provided by application is not enough to receive frame. */
            if (buffNum > frame->length)
            {
                return kStatus_NETC_LackOfResource;
            }

            /* Prepare the buffer from appliction to exchange with the buffer in the BD. */
            index = 0;
            do
            {
                newBuff = handle->cfg.rxBuffAlloc(handle, ring, rxBdRing->buffSize, handle->cfg.userData);
                if (newBuff == NULL)
                {
                    while (index-- > 0U)
                    {
                        handle->cfg.rxBuffFree(handle, ring, frame->buffArray[index].buffer, handle->cfg.userData);
                    }
                    /* When appliction buffer pool is not enough, drop frame in the BD to keep frame latest. */
                    result = kStatus_NETC_LackOfResource;
                    break;
                }

                /* Store in this strcuture, and exchange the buffer in the BD in below code. */
                frame->buffArray[index].buffer = newBuff;
                index++;
            } while (--buffNum != 0U);
        }
        else
        {
            /* Get Transmit Timestamp Reference Response messages */
            return kStatus_NETC_RxTsrResp;
        }
    }
    result = EP_ReceiveFrameCommon(handle, rxBdRing, ring, frame, attr, (result != kStatus_Success),
                                   handle->cfg.rxCacheMaintain);
    return result;
}

status_t EP_CmdBDRInit(ep_handle_t *handle, const netc_cmd_bdr_config_t *config)
{
    assert(handle != NULL);

    status_t result;

    result = NETC_CmdBDRInit((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, config);
    if (result != kStatus_Success)
    {
        return result;
    }

    handle->cmdBdRing.bdBase        = config->bdBase;
    handle->cmdBdRing.bdLength      = config->bdLength;
    handle->cmdBdRing.producerIndex = 0U;
    handle->cmdBdRing.cleanIndex    = 0U;
    handle->cmdBdRing.bdrEnable     = true;

    return result;
}

status_t EP_CmdBDRDeinit(ep_handle_t *handle)
{
    assert(handle != NULL);
    return NETC_CmdBDRDeinit((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR);
}

status_t EP_RxIPFInit(ep_handle_t *handle, netc_ep_ipf_config_t *config)
{
    NETC_IPFInit(handle->hw.common, &config->dosCfg);
    NETC_PortSetIPF(handle->hw.portGroup.port, &config->portConfig);

    return kStatus_Success;
}

status_t EP_RxIPFAddTableEntry(ep_handle_t *handle, netc_tb_ipf_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddIPFTableEntry(&cdbrHandle, config, entryID);
}

status_t EP_RxIPFUpdateTableEntry(ep_handle_t *handle, uint32_t entryID, netc_tb_ipf_cfge_t *cfg)
{
    assert((handle != NULL) && (cfg != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_UpdateIPFTableEntry(&cdbrHandle, entryID, cfg);
}

status_t EP_RxIPFDelTableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_DelIPFTableEntry(&cdbrHandle, entryID);
}

status_t EP_RxIPFResetMatchCounter(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_ResetIPFMatchCounter(&cdbrHandle, entryID);
}

status_t EP_RxIPFGetMatchedCount(ep_handle_t *handle, uint32_t entryID, uint64_t *count)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_GetIPFMatchedCount(&cdbrHandle, entryID, count);
}

status_t EP_RxPSFPAddSGITableEntry(ep_handle_t *handle, netc_tb_sgi_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateSGITableEntry(&cdbrHandle, config, true);
}

