JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hashIndex = 0;
    uint64_t mac      = 0;
    int i             = 0;

    /* Calculate the hash index. */
    for (i = 5; i >= 0; i--)
    {
        mac = (mac << 8U) | macAddr[i];
    }
    for (i = 0; i < 8; i++)
    {
        hashIndex ^= (uint8_t)(mac & 0x3FU);
        mac = mac >> 6U;
    }

    NETC_EnetcAddMacAddrHash(handle->hw.base, siNum, type, hashIndex);

    /* Added the used count of hash index. */
    if (type == kNETC_PacketUnicast)
    {
        handle->unicastHashCount[hashIndex]++;
    }
    else
    {
        handle->multicastHashCount[hashIndex]++;
    }

    return kStatus_Success;
}

status_t EP_RxL2MFDelHashEntry(ep_handle_t *handle, netc_packet_type_t type, uint8_t *macAddr)
{
    assert(type != kNETC_PacketBroadcast);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hashIndex = 0;
    uint64_t mac      = 0;
    int i             = 0;

    /* Calculate the hash index. */
    for (i = 5; i >= 0; i--)
    {
        mac = (mac << 8U) | macAddr[i];
    }
    for (i = 0; i < 8; i++)
    {
        hashIndex ^= (uint8_t)(mac & 0x3FU);
        mac = mac >> 6U;
    }

    if (type == kNETC_PacketUnicast)
    {
        if (handle->unicastHashCount[hashIndex] == 0U)
        {
            return kStatus_Fail;
        }
        else
        {
            /* Delete the hash index when there's no address using this index. */
            if (--handle->unicastHashCount[hashIndex] == 0U)
            {
                NETC_EnetcDelMacAddrHash(handle->hw.base, siNum, type, hashIndex);
            }
        }
    }
    else
    {
        if (handle->multicastHashCount[hashIndex] == 0U)
        {
            return kStatus_Fail;
        }
        else
        {
            /* Delete the hash index when there's no other MAC address using this hash index. */
            if (--handle->multicastHashCount[hashIndex] == 0U)
            {
                NETC_EnetcDelMacAddrHash(handle->hw.base, siNum, type, hashIndex);
            }
        }
    }

    return kStatus_Success;
}

status_t EP_RxL2MFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint8_t *macAddr)
{
    assert((handle != NULL) && ((macAddr != NULL)));
    uint64_t address =
        ((uint64_t)macAddr[4] << 32U) + ((uint64_t)macAddr[5] << 40U) + *(uint32_t *)(uintptr_t)&macAddr[0];
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = address;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = (uint32_t)1U << getSiNum(handle->cfg.si);
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 1;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

status_t EP_RxL2MFDelEMTableEntry(ep_handle_t *handle, uint32_t idx)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = 0;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = 0;
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 1;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

status_t EP_RxL2VFInit(ep_handle_t *handle, netc_si_l2vf_config_t *config)
{
    NETC_EnetcConfigureVlanFilter(handle->hw.base, getSiNum(handle->cfg.si), config);
    return kStatus_Success;
}

status_t EP_RxL2VFAddHashEntry(ep_handle_t *handle, uint16_t vlanId)
{
    assert(handle != NULL);
    assert(vlanId <= 0xFFFU);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hash0     = (uint8_t)((vlanId >> 6U) & 0x3FU);
    uint8_t hash1     = (uint8_t)(vlanId & 0x3FU);
    uint8_t hashIndex = hash0 ^ hash1;

    NETC_EnetcAddVlanHash(handle->hw.base, siNum, hashIndex);

    /* Added the used count of hash index. */
    handle->vlanHashCount[hashIndex]++;

    return kStatus_Success;
}

status_t EP_RxL2VFDelHashEntry(ep_handle_t *handle, uint16_t vlanId)
{
    assert(handle != NULL);
    assert(vlanId <= 0xFFFU);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hash0     = (uint8_t)((vlanId >> 6U) & 0x3FU);
    uint8_t hash1     = (uint8_t)(vlanId & 0x3FU);
    uint8_t hashIndex = hash0 ^ hash1;

    if (handle->vlanHashCount[hashIndex] == 0U)
    {
        return kStatus_Fail;
    }
    else
    {
        /* Delete the hash index when there's no other VLAN ID using this hash index. */
        if (--handle->vlanHashCount[hashIndex] == 0U)
        {
            NETC_EnetcDelVlanHash(handle->hw.base, siNum, hashIndex);
        }
    }

    return kStatus_Success;
}

status_t EP_RxL2VFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint16_t vlanId, netc_vlan_tpid_select_t tpid)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = (uint64_t)vlanId | ((uint64_t)tpid << 16U);
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = (uint32_t)1U << getSiNum(handle->cfg.si);
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 2;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

status_t EP_RxL2VFDelEMTableEntry(ep_handle_t *handle, uint32_t idx)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = 0;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = 0;
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 2;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable, uint8_t gateState)
#else
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable)
#endif
{
    assert(handle != NULL);
    status_t result = kStatus_Success;

    if (enable)
    {
        handle->hw.portGroup.port->PTGSCR |= NETC_PORT_PTGSCR_TGE_MASK;
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
        netc_tgs_gate_entry_t gate[2] = {{.interval = 50000U, .tcGateState = gateState},
                                         {.interval = 50000U, .tcGateState = gateState}};
        netc_tb_tgs_gcl_t wTgsList    = {.cycleTime = 1000000U, .numEntries = 2U, .gcList = &gate[0]};
        uint32_t timeLow, timeHigh;
        /* Enable master bus and memory access for default ns timer*/
        NETC_F0_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
        /* Read low bytes first to make high bytes store in shadow register */
        if ((TMR0_BASE->TMR_CTRL & ENETC_PF_TMR_TMR_CTRL_TE_MASK) != 0)
        {
            /* 1588 timer enabled, a read to TMR_FRT_L captures all 64b of SRT_H/L */
            TMR0_BASE->TMR_FRT_L;
            timeLow  = TMR0_BASE->TMR_SRT_L;
            timeHigh = TMR0_BASE->TMR_SRT_H;
        }
        else
        {
            /* Default counter, Read low bytes first to make high bytes store in shadow register */
            TMR0_BASE->TMR_DEF_CNT_L;
            timeLow  = TMR0_BASE->TMR_DEF_CNT_L;
            timeHigh = TMR0_BASE->TMR_DEF_CNT_H;
        }
        wTgsList.baseTime = ((uint64_t)timeHigh << 32U) + timeLow;
        result            = EP_TxTGSConfigAdminGcl(handle, &wTgsList);
#endif
    }
    else
    {
        handle->hw.portGroup.port->PTGSCR &= ~NETC_PORT_PTGSCR_TGE_MASK;
    }

    return result;
}

status_t EP_TxTGSConfigAdminGcl(ep_handle_t *handle, netc_tb_tgs_gcl_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_ConfigTGSAdminList(&cdbrHandle, config);
}

status_t EP_TxtTGSGetOperGcl(ep_handle_t *handle, netc_tb_tgs_gcl_t *gcl, uint32_t length)
{
    assert((handle != NULL) && (gcl != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_GetTGSOperationList(&cdbrHandle, gcl, length);
}

