JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.c
status_t EP_TxTrafficClassConfig(ep_handle_t *handle, netc_hw_tc_idx_t tcIdx, const netc_port_tx_tc_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    status_t reseult;

    if (!NETC_PortIsPseudo(handle->hw.portGroup.port))
    {
        uint32_t temp                    = handle->hw.portGroup.port->PFPCR & (~((uint32_t)1U << (uint32_t)tcIdx));
        handle->hw.portGroup.port->PFPCR = temp | ((uint32_t)config->enPreemption << (uint32_t)tcIdx);
    }

    (void)NETC_EnetcPortEnableTSD(handle->hw.base, tcIdx, config->enableTsd);

    reseult = NETC_PortConfigTcMaxSDU(handle->hw.portGroup.port, tcIdx, &config->sduCfg);
    if ((kStatus_Success == reseult) && (config->enableCbs))
    {
        reseult = NETC_PortConfigTcCBS(handle->hw.portGroup.port, tcIdx, &config->cbsCfg);
    }
    return reseult;
}

status_t EP_RxPSFPAddISITableEntry(ep_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL) && (entryID != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddISITableEntry(&cdbrHandle, config, entryID);
}

status_t EP_RxPSFPDelISITableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_DelISITableEntry(&cdbrHandle, entryID);
}

status_t EP_RxPSFPAddISTableEntry(ep_handle_t *handle, netc_tb_is_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateISTableEntry(&cdbrHandle, config, true);
}

status_t EP_RxPSFPUpdateISTableEntry(ep_handle_t *handle, netc_tb_is_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateISTableEntry(&cdbrHandle, config, false);
}

status_t EP_RxPSFPDelISTableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_DelISTableEntry(&cdbrHandle, entryID);
}

status_t EP_RxPSFPAddISFTableEntry(ep_handle_t *handle, netc_tb_isf_config_t *config, uint32_t *entryID)
{
    assert((handle != NULL) && (config != NULL) && (entryID != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddISFTableEntry(&cdbrHandle, config, entryID);
}

status_t EP_RxPSFPUpdateISFTableEntry(ep_handle_t *handle, uint32_t entryID, netc_tb_isf_cfge_t *cfg)
{
    assert((handle != NULL) && (cfg != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_UpdateISFTableEntry(&cdbrHandle, entryID, cfg);
}

status_t EP_RxPSFPDelISFTableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_DelISFTableEntry(&cdbrHandle, entryID);
}

status_t EP_RxPSFPAddISCTableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddISCTableEntry(&cdbrHandle, entryID);
}

status_t EP_RxPSFPGetISCStatistic(ep_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_GetISCStatistic(&cdbrHandle, entryID, statistic);
}

status_t EP_RxPSFPResetISCStatistic(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_ResetISCStatistic(&cdbrHandle, entryID);
}

void EP_PsiEnableInterrupt(ep_handle_t *handle, uint32_t mask, bool enable)
{
    /* Check whether VSI number is over the capability. */
    assert(((uint16_t)mask >> handle->capability.vsiNum) <= 1U);
    assert(((uint16_t)(mask >> 16U) >> handle->capability.vsiNum) <= 1U);
    assert(getSiNum(handle->cfg.si) == 0U);
    NETC_SIPsiEnableInterrupt(handle->hw.si, mask, enable);
}

uint32_t EP_PsiGetStatus(ep_handle_t *handle)
{
    assert(handle->capability.vsiNum > 0U);
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiGetStatus(handle->hw.si);
}

void EP_PsiClearStatus(ep_handle_t *handle, uint32_t mask)
{
    /* Check whether VSI number is over the capability. */
    assert(((uint16_t)mask >> handle->capability.vsiNum) <= 1U);
    assert(((uint16_t)(mask >> 16U) >> handle->capability.vsiNum) <= 1U);
    assert(handle->capability.vsiNum > 0U);
    assert(getSiNum(handle->cfg.si) == 0U);
    NETC_SIPsiClearStatus(handle->hw.si, mask);
}

status_t EP_PsiSendMsg(ep_handle_t *handle, uint16_t msg, netc_vsi_number_t vsi)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiSendMsg(handle->hw.si, msg, vsi);
}

bool EP_PsiCheckTxBusy(ep_handle_t *handle, netc_vsi_number_t vsi)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiCheckTxBusy(handle->hw.si, vsi);
}

status_t EP_PsiSetRxBuffer(ep_handle_t *handle, netc_vsi_number_t vsi, uint64_t buffAddr)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiSetRxBuffer(handle->hw.si, vsi, buffAddr);
}

status_t EP_PsiGetRxMsg(ep_handle_t *handle, netc_vsi_number_t vsi, netc_psi_rx_msg_t *msgInfo)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiGetRxMsg(handle->hw.si, vsi, msgInfo);
}

void EP_VsiEnableInterrupt(ep_handle_t *handle, uint32_t mask, bool enable)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiEnableInterrupt(handle->hw.si, mask, enable);
}

uint32_t EP_VsiGetStatus(ep_handle_t *handle)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiGetStatus(handle->hw.si);
}

void EP_VsiClearStatus(ep_handle_t *handle, uint32_t mask)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiClearStatus(handle->hw.si, mask);
}

status_t EP_VsiSendMsg(ep_handle_t *handle, uint64_t msgAddr, uint32_t msgLen)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiSendMsg(handle->hw.si, msgAddr, msgLen);
}

void EP_VsiCheckTxStatus(ep_handle_t *handle, netc_vsi_msg_tx_status_t *status)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiCheckTxStatus(handle->hw.si, status);
}

status_t EP_VsiReceiveMsg(ep_handle_t *handle, uint16_t *msg)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiReceiveMsg(handle->hw.si, msg);
}
